In [ ]:
"""Find out number of different titles within each deparments, order by dept_no ascending"""

In [ ]:
"""SQL table creation and data insertion"""
drop table if exists  `departments` ; 
drop table if exists  `dept_emp` ; 
drop table if exists  titles ;

CREATE TABLE `departments` (
`dept_no` char(4) NOT NULL,
`dept_name` varchar(40) NOT NULL,
PRIMARY KEY (`dept_no`));

CREATE TABLE `dept_emp` (
`emp_no` int(11) NOT NULL,
`dept_no` char(4) NOT NULL,
`from_date` date NOT NULL,
`to_date` date NOT NULL,
PRIMARY KEY (`emp_no`,`dept_no`));

CREATE TABLE titles (
`emp_no` int(11) NOT NULL,
`title` varchar(50) NOT NULL,
`from_date` date NOT NULL,
`to_date` date DEFAULT NULL);

INSERT INTO departments VALUES('d001','Marketing');
INSERT INTO departments VALUES('d002','Finance');

INSERT INTO dept_emp VALUES(10001,'d001','1986-06-26','9999-01-01');
INSERT INTO dept_emp VALUES(10002,'d001','1996-08-03','9999-01-01');
INSERT INTO dept_emp VALUES(10003,'d002','1995-12-03','9999-01-01');

INSERT INTO titles VALUES(10001,'Senior Engineer','1986-06-26','9999-01-01');
INSERT INTO titles VALUES(10002,'Staff','1996-08-03','9999-01-01');
INSERT INTO titles VALUES(10003,'Senior Engineer','1995-12-03','9999-01-01');

In [ ]:
"""SQL solution"""
SELECT d.dept_no, d.dept_name, t.title, COUNT(*) 
FROM departments AS d
INNER JOIN dept_emp AS de
ON d.dept_no = de.dept_no
INNER JOIN titles AS t
ON de.emp_no = t.emp_no
GROUP BY d.dept_no, d.dept_name, t.title
ORDER BY d.dept_no dESC

In [3]:
"""pandas dataframe cration"""
import numpy as np
import pandas as pd

t_dept = np.array([['d001','Marketing'],
                   ['d002','Finance']])
t_dept_emp = np.array([[10001,'d001','1986-06-26','9999-01-01'],
                       [10002,'d001','1996-08-03','9999-01-01'],
                       [10003,'d002','1995-12-03','9999-01-01']])
t_titles = np.array([[10001,'Senior Engineer','1986-06-26','9999-01-01'],
                     [10002,'Staff','1996-08-03','9999-01-01'],
                     [10003,'Senior Engineer','1995-12-03','9999-01-01']])

departments = pd.DataFrame(data=t_dept, columns=['dept_no', 'dept_name'])
dept_emp = pd.DataFrame(data=t_dept_emp, columns=['emp_no', 'dept_no', 'from_date', 'to_date'])
titles = pd.DataFrame(data=t_titles, columns=['emp_no', 'title', 'from_date', 'to_date'])
departments.head()

  dept_no  dept_name
0    d001  Marketing
1    d002    Finance

In [4]:
dept_emp.head()

  emp_no dept_no   from_date     to_date
0  10001    d001  1986-06-26  9999-01-01
1  10002    d001  1996-08-03  9999-01-01
2  10003    d002  1995-12-03  9999-01-01

In [5]:
titles.head()

  emp_no            title   from_date     to_date
0  10001  Senior Engineer  1986-06-26  9999-01-01
1  10002            Staff  1996-08-03  9999-01-01
2  10003  Senior Engineer  1995-12-03  9999-01-01

In [12]:
df = pd.merge(departments, dept_emp[['emp_no', 'dept_no']], on='dept_no', how='inner')
df = pd.merge(df, titles[['emp_no', 'title']], on='emp_no', how='inner')
df

  dept_no  dept_name emp_no            title
0    d001  Marketing  10001  Senior Engineer
1    d001  Marketing  10002            Staff
2    d002    Finance  10003  Senior Engineer

In [23]:
df.groupby(['dept_no', 'dept_name', 'title']).count().reset_index().rename(columns={'emp_no': 'count'}).sort_values(by='dept_no')

  dept_no  dept_name            title  count
0    d001  Marketing  Senior Engineer      1
1    d001  Marketing            Staff      1
2    d002    Finance  Senior Engineer      1